Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/svd/ATSAMG51G18.svd
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>SPI_CSR[%s]</name>
               <description>Chip Select Register 0</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CPOL</name>
                     <description>Clock Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NCPHA</name>
                     <description>Clock Phase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSNAAT</name>
                     <description>Chip Select Not Active After Transfer (Ignored if CSAAT = 1)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSAAT</name>
                     <description>Chip Select Active After Transfer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BITS</name>
                     <description>Bits Per Transfer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BITSSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8 bits for transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_9_BIT</name>
                           <description>9 bits for transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_10_BIT</name>
                           <description>10 bits for transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_11_BIT</name>
                           <description>11 bits for transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BIT</name>
                           <description>12 bits for transfer</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_13_BIT</name>
                           <description>13 bits for transfer</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_14_BIT</name>
                           <description>14 bits for transfer</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_15_BIT</name>
                           <description>15 bits for transfer</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16 bits for transfer</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCBR</name>
                     <description>Serial Clock Baud Rate</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBS</name>
                     <description>Delay Before SPCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBCT</name>
                     <description>Delay Between Consecutive Transfers</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x535049</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_RPR</name>
               <description>Receive Pointer Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXPTR</name>
                     <description>Receive Pointer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_RCR</name>
               <description>Receive Counter Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXCTR</name>
                     <description>Receive Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_TPR</name>
               <description>Transmit Pointer Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXPTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_TCR</name>
               <description>Transmit Counter Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXCTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_RNPR</name>
               <description>Receive Next Pointer Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNPTR</name>
                     <description>Receive Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_RNCR</name>
               <description>Receive Next Counter Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNCTR</name>
                     <description>Receive Next Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_TNPR</name>
               <description>Transmit Next Pointer Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNPTR</name>
                     <description>Transmit Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_TNCR</name>
               <description>Transmit Next Counter Register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNCTR</name>
                     <description>Transmit Counter Next</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_PTCR</name>
               <description>Transfer Control Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTDIS</name>
                     <description>Receiver Transfer Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTDIS</name>
                     <description>Transmitter Transfer Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPI_PTSR</name>
               <description>Transfer Status Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
