Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/svd/ATSAMG51G18.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>11228F</version>
         <description>Supply Controller</description>
         <groupName>SUPC</groupName>
         <prependToName>SUPC_</prependToName>
         <baseAddress>0x400E1410</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>SUPC_CR</name>
               <description>Supply Controller Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>This bit must always be written to 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALSEL</name>
                     <description>Crystal Oscillator Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>XTALSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_SEL</name>
                           <description>If KEY is correct, switches the slow clock on the crystal oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_SMMR</name>
               <description>Supply Controller Supply Monitor Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMTH</name>
                     <description>Supply Monitor Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SMSMPL</name>
                     <description>Supply Monitor Sampling Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SMSMPLSelect</name>
                        <enumeratedValue>
                           <name>SMD</name>
                           <description>Supply Monitor disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSM</name>
                           <description>Continuous Supply Monitor</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 32 SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 256 SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 2,048 SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMRSTEN</name>
                     <description>Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMIEN</name>
                     <description>Supply Monitor Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMIENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_MR</name>
               <description>Supply Controller Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BODRSTEN</name>
                     <description>POR Core Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a brownout detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal vddcore_nreset is asserted when a brownout detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODDIS</name>
                     <description>POR Core Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core brownout detector is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The core brownout detector is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSCBYPASS</name>
                     <description>Oscillator Bypass</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCBYPASSSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect. Clock selection depends on XTALSEL value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_SR</name>
               <description>Supply Controller Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BODRSTS</name>
                     <description>Brownout Detector Reset Status (cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODRSTSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No core brownout rising edge event has been detected since the last read of SUPC_SR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESENT</name>
                           <description>At least one brownout output rising edge event has been detected since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMRSTS</name>
                     <description>Supply Monitor Reset Status (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMRSTSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No supply monitor detection has generated a core reset since the last read of SUPC_SR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESENT</name>
                           <description>At least one supply monitor detection has generated a core reset since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMS</name>
                     <description>Supply Monitor Status (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No supply monitor detection since the last read of SUPC_SR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESENT</name>
                           <description>At least one supply monitor detection since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMOS</name>
                     <description>Supply Monitor Output Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMOSSelect</name>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>The supply monitor detected VDDIO higher than its threshold at its last measurement.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>The supply monitor detected VDDIO lower than its threshold at its last measurement.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSCSEL</name>
                     <description>32-kHz Oscillator Selection Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>The slow clock SLCK is generated by the embedded 32 kHz RC oscillator.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYST</name>
                           <description>The slow clock SLCK is generated by the 32 kHz crystal oscillator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
