Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/svd/ATSAMG51G18.svd
            <register>
               <name>US_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x000C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>RXRDY Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>TXRDY Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBRK</name>
                     <description>Receiver Break Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Receive Buffer Transfer Interrupt Disable (available in all USART modes of operation)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of Transmit Buffer Interrupt Disable (available in all USART modes of operation)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error Interrupt Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time-out Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>TXEMPTY Interrupt Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>Transmit Buffer Empty Interrupt Disable (available in all USART modes of operation)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Receive Buffer Full Interrupt Disable (available in all USART modes of operation)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIC</name>
                     <description>Clear to Send Input Change Interrupt Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>RXRDY Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>TXRDY Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBRK</name>
                     <description>Receiver Break Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Receive Buffer Interrupt Mask (available in all USART modes of operation)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of Transmit Buffer Interrupt Mask (available in all USART modes of operation)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error Interrupt Mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time-out Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>TXEMPTY Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Receive Buffer Full Interrupt Mask (available in all USART modes of operation)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIC</name>
                     <description>Clear to Send Input Change Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CSR</name>
               <description>Channel Status Register</description>
               <addressOffset>0x0014</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBRK</name>
                     <description>Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of RX Buffer (cleared by writing US_RCR or US_RNCR)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of TX Buffer (cleared by writing US_TCR or US_TNCR)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Receiver Time-out (cleared by writing a one to bit US_CR.STTTO)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>TX Buffer Empty (cleared by writing US_TCR or US_TNCR)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>RX Buffer Full (cleared by writing US_RCR or US_RNCR)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIC</name>
                     <description>Clear to Send Input Change Flag (cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Image of CTS Input</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RHR</name>
               <description>Receive Holding Register</description>
               <addressOffset>0x0018</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXCHR</name>
                     <description>Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RXSYNH</name>
                     <description>Received Sync</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXCHR</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TXSYNH</name>
                     <description>Sync Field to be Transmitted</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_BRGR</name>
               <description>Baud Rate Generator Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CD</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FP</name>
                     <description>Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RTOR</name>
               <description>Receiver Time-out Register</description>
               <addressOffset>0x0024</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TO</name>
                     <description>Time-out Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TTGR</name>
               <description>Transmitter Timeguard Register</description>
               <addressOffset>0x0028</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TG</name>
                     <description>Timeguard Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_NER</name>
               <description>Number of Errors Register</description>
               <addressOffset>0x0044</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NB_ERRORS</name>
                     <description>Number of Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x00E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x555341</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RPR</name>
               <description>Receive Pointer Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXPTR</name>
                     <description>Receive Pointer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RCR</name>
               <description>Receive Counter Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXCTR</name>
                     <description>Receive Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TPR</name>
               <description>Transmit Pointer Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXPTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TCR</name>
               <description>Transmit Counter Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXCTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RNPR</name>
               <description>Receive Next Pointer Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNPTR</name>
                     <description>Receive Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RNCR</name>
               <description>Receive Next Counter Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNCTR</name>
                     <description>Receive Next Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TNPR</name>
               <description>Transmit Next Pointer Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNPTR</name>
                     <description>Transmit Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TNCR</name>
               <description>Transmit Next Counter Register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNCTR</name>
                     <description>Transmit Counter Next</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
